{
  "title": "Research",
  "image": "research.jpg",
  "description": "Our research focuses on tailoring nanocrystal properties through surface modification at atomic level, engineering nanocrystal thin films through electronic modeling at structural level, and designing electronic and optoelectronic nanocrystal device for practical applications such as energy harvesting and sensing technology.",
  "sections": [
    {
      "title": "Nanocrystal Properties",
      "content": "A nanocrystal (NC) is a crystalline material particle having a dimension of ~10nm. At this small dimension, these particles exhibit unique size dependent electronic and optical properties. Unlike bulk materials, NCs properties are mainly dominated by the surface chemistry and properties due to the large surface area to volume ratio, giving us more opportunities to tailor the electronic properties of NCs. One of the most important challenges in utilizing semiconductor NCs for devices is to understand how to control their electronic properties and surface trap states. Their properties could be modified by surface modification before or after the NC thin film formation through solution process. With the novel and careful surface and ligands modifications, we can tune the inherent electronic properties of NCs and NC thin films, such as carrier statistics, carrier type, carrier concentration, mobility, conductivity, and Fermi level precisely upon our needs."
    },
    {
      "title": "Device Engineering",
      "content": "Next, we seek to design high performance electronic and optoelectronic devices through NC thin film engineering. Through the surface modification described above and various characterization methods, desirable n-type or p-type NC thin films can be accomplished for each application. The electronic device engineering that will be pursued includes: low doping profile and long lifetime for photovoltaics, high mobility for transistors, less trap states for photodetectors, and optimized-heavily doping for thermoelectric devices. The novel structure of p-i-n junction, ideal MOSFET, and MESFET will be implemented. These NC structures will be the building blocks for the alternatives of the current technology."
    },
    {
      "title": "Flexible and Wearable Electronics",
      "content": "We target to build these devices not only on conventional rigid substrates of silicon but also on flexible or stretchable devices. Unconventional materials, designs, and strategies with unique concepts will be adopted for wearable electronic devices. Soft NC electronic devices will be constructed for energy harvesting and sensing applications for the next generation technology."
    }
  ]
}
